def area(a, b):
    '''
    Возвращает площадь прямоугольника в десятичном формате.

        Параметры:
        a (int): Первое десятичное целое число
        b (int): Второе десятичное целое число

        Возвращаемое значение:
        area (int): Площадь прямоугольника

        Пример вызова:
            Ввод:

            a = 3
            b = 2

            Вывод:

            area = 6


    '''
    return a * b

def perimeter(a, b):
    '''
        Возвращает периметр прямоугольника в десятичном формате.

            Параметры:
            a (int): Первое десятичное целое число
            b (int): Второе десятичное целое число

            Возвращаемое значение:
            perimetr (int): Периметр прямоугольника

            Пример вызова:
            Ввод:

            a = 3
            b = 2

            Вывод:

            perimetr = 10
        '''
    return (a + b) * 2